print('所谓可变类型与不可变类型是指:数据能够直接进行修改，如果能直接修改那么就是可变，否则是不可变')
print('可变：列表，字典，集合')
print('不可变：整型，浮点型，字符串，元组')

print('id(目标)返回地址***********************')
#1.1 声明变量保存整型数据，把这个数据赋值到另一个变量; id()检测两个变量的id值(内存的十进制值)
a=1
b=a
print(id(a))#140718787008160
print(id(b))#140718787008160
b=5
print(a)#1
print('*********************************')
#不可变
a=1.1
b=a
print(id(a))#1563469355824
print(id(b))#1563469355824
b=5.5
print(a)#1.1

print('****可变类型：列表*********************')
aa=[10,20]
bb=aa
print(bb)#[10, 20]
print(id(aa))#2071219806784
print(id(bb))#2071219806784
aa.append(30)
print(aa)#[10, 20, 30]
print(bb)#[10, 20, 30]
print(id(aa))#2481080243072
print(id(bb))#2481080243072






