s1={10,20}
print('---------add() ,集合可变类型，不可序')
s1.add(100)
print(s1)#{100, 10, 20}
print('集合有去重功能！')
s1.add(100)
print(s1)#{100, 10, 20}
#s1.add([10,20,30])
#print(s1) 报错！！！

print('---------update() 增加的数据是 *序列*')
print(f's1:{s1}')
s1.update([10,20,30,50])
print(s1)#{100, 10, 50, 20, 30}
#s1.update(100)
#print(s1) 报错！！

print('------------------------删除-----------------------------------')
s1={10,20,30,40,50}
print('remove()')
s1.remove(10)
print(s1)#{40, 50, 20, 30}

print('discard():删除指定数据，数据不存在也不报错----------------------------------')
s1={10,20,30,40,50}
print(s1)
s1.discard(10)
print(s1)#{40, 50, 20, 30}
s1.discard(10)
print(s1)#{40, 50, 20, 30}  不会报错

print('----pop()随机删除某个数据，并返回这个数据----')
s1={10,20,30,40,50}
print(s1)
del_num=s1.pop()
print(del_num)  #40
print(s1)   #{10, 50, 20, 30}

print('----pop()随机删除某个数据，并返回这个数据----')

print('------------------------查找-----------------------------------')
s1={10,20,30,40,50}
print(10 in s1)#10 在集合中 返回True
print(10 not in s1)#False










